#pragma once

//------------------------------------------------------------------------------------------------//
// @brief 構造体宣言
//------------------------------------------------------------------------------------------------//
struct vec2
{
    float x;
    float y;
};

//------------------------------------------------------------------------------------------------//
// @brief 定数宣言
//------------------------------------------------------------------------------------------------//

//! 移動アニメーション数
const int moveAnimNum = 4;

//! 攻撃アニメーション数
const int attackAnimNum = 4;

//! 被弾アニメーション数
const int damageAnimNum = 2;

//! 小さいモンスターの大きさ
const vec2 monsterScaleS = { 64.0f };

//! 中ぐらいのモンスターの大きさ
const vec2 monsterScaleM = { 256.0f };
